[
  {
    "url": "https://pinchofyum.com/chipotle-salmon-with-orange-salsa-and-aji-verde",
    "title": "Chipotle Salmon with Orange Salsa and Aji Verde",
    "ingredients": [
      "1 1/2 pounds salmon filet (I have used both skinless and skin-on; either works)",
      "2 tablespoons taco seasoning (I use Siete)",
      "2 tablespoons brown sugar",
      "¼ to ½ teaspoon chipotle powder, depending on spice preference",
      "spritz of avocado oil",
      "3 large navel oranges, cut into chunks (peeled with a knife, pith removed)",
      "a small wedge of purple cabbage, finely shredded or pulsed in a food processor (about 2 cups)",
      "½ cup chopped cilantro",
      "a small wedge of red onion, minced (about 1/4 cup)",
      "1-2 tablespoons olive oil or avocado oil",
      "juice of 2 limes (2-3 tablespoons)",
      "half of a jalapeño (ribs and seeds removed)",
      "1 tablespoon sugar + ½ teaspoon salt (more to taste)",
      "2 tablespoons olive oil",
      "1/2 cup mayo",
      "1 cup cilantro leaves and stems",
      "half of a jalapeño pepper (ribs and seeds removed)",
      "1 clove garlic",
      "juice of 1 lime",
      "a pinch of salt, to taste",
      "Rice for serving"
    ],
    "instructions": "Make Orange Salsa\nToss all ingredients together except oranges; massage with your hands to soften the cabbage a bit. (You’ll add the oranges until right before serving, so they don’t turn pink.)\nMake Aji Verde\nBlend the aji verde sauce until smooth.\nPrep Salmon:\nPreheat oven to 450 degrees; place a rack near the top. Pat salmon dry with paper towels. Place on a sheet pan lined with parchment (I just leave the filets in one whole piece). Mix seasoning for salmon; coat salmon filets with seasoning. Spritz with a light coating avocado oil.\nBake Salmon\nBake for 5 minutes near the top of the oven. Then broil another 4-6 minutes until cooked to your liking (I like it to be medium, about 135 degrees).\nServe\nAdd oranges to the slaw mixture. Put rice and aji verde side by side on the bottom of a plate or shallow bowl. Then flake a few chunks of salmon on top, and finish with a scoop of the salsa. Chef’s kiss!",
    "image": "https://pinchofyum.com/uploads/Chipotle-Salmon-with-Orange-Salsa-960x1440.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "813 calories",
      "sugarContent": "19.8 g",
      "sodiumContent": "478.8 mg",
      "fatContent": "43.2 g",
      "saturatedFatContent": "6.6 g",
      "transFatContent": "0.1 g",
      "carbohydrateContent": "66.4 g",
      "fiberContent": "4.7 g",
      "proteinContent": "43.6 g",
      "cholesterolContent": "98.5 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/creamy-chicken-and-gnocchi",
    "title": "Creamy Chicken and Gnocchi",
    "ingredients": [
      "1 tablespoon olive oil",
      "1 lb. chicken breasts, pounded thin, or thinly sliced as pictured",
      "1 tablespoon seasoning of choice (I like the McCormick rotisserie chicken seasoning)",
      "1 tablespoon olive oil",
      "1 large shallot, thinly sliced or minced",
      "1/4 cup sun-dried tomatoes packed in oil, drained (love DeLallo’s!), or similar (see notes)",
      "12 ounces store-bought gnocchi (I use DeLallo gnocchi)",
      "2 cups chicken broth (more as needed)",
      "1/2 cup cream",
      "1 cup packed spinach leaves, torn into smaller pieces",
      "salt and pepper, to taste",
      "fresh thyme, to taste",
      "grated Parmesan, to taste"
    ],
    "instructions": "Chicken\nHeat the oil in a large, wide skillet over medium high heat. Season the chicken on both sides (you may need more than 1 tablespoon depending on your seasoning blend – I usually just eyeball it until they’re evenly coated). Add chicken to the hot pan; cook for 3-4 minutes per side until golden brown and cooked through (165 degrees F). Remove chicken and set aside.\nShallots\nIn the same pan, add the oil, shallots, and sun dried tomatoes. Sauté for 5 minutes until the shallots are golden and softened.\nGnocchi\nAdd the gnocchi and broth. Simmer for another 5 minutes, until the gnocchi are tender.\nCream\nAdd the cream and spinach; stir to combine. Keep it at a low simmer for a few minutes to further thicken the sauce.\nSeason\nAdd salt, pepper, and fresh thyme leaves to taste. Add chicken back in.\nServe pieces of chicken with a scoop of the creamy gnocchi and a spoonful of the extra sauce over the top. Add a sprinkle of Parmesan on top, or into the sauce, for even more flavor. SO yum.",
    "image": "https://pinchofyum.com/tachyon/Creamy-Chicken-and-Gnocchi.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "427 calories",
      "sugarContent": "1.2 g",
      "sodiumContent": "1450.6 mg",
      "fatContent": "17.1 g",
      "saturatedFatContent": "5.5 g",
      "transFatContent": "0.2 g",
      "carbohydrateContent": "36.9 g",
      "fiberContent": "0.8 g",
      "proteinContent": "31.6 g",
      "cholesterolContent": "103.1 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/focaccia-grinder-sandwich",
    "title": "Focaccia Grinder Sandwich",
    "ingredients": [
      "1 loaf of focaccia (I use the Trader Joe’s focaccia with roasted tomato and Parmesan)",
      "1/4 cup pesto (refrigerated one from TJ’s)",
      "2 ounces uncured calabrese salame (8 slices)",
      "2 ounces uncured capocollo (8 slices)",
      "4 large slices Provolone cheese",
      "1 head romaine lettuce, shredded (2-3 cups)",
      "a quarter of a red onion, thinly sliced",
      "1/2 cup sliced pepperoncini",
      "1/4 to 1/3 cup Italian dressing",
      "1/2 teaspoon dried oregano",
      "salt and pepper to taste",
      "1/4 cup mayo (optional)"
    ],
    "instructions": "Preheat Oven\nPreheat the oven to 350 degres.\nSlice Focaccia\nKeeping the focaccia flat, use a serrated knife to cut the focaccia in half horizontally. (You don’t want to tip the bread up because all the toppings will fall off.) Lift the top half of the bread off and set to the side.\nLayer Sandwich\nLayer the bottom piece of focaccia with pesto. Then layer the salame, capocollo, and Provolone.\nToast Sandwich\nToast in the oven for 6-8 minutes. (Leave the top piece laying to the side so it doesn’t stick to the cheese yet.)\nToss and Layer Greens\nIn a separate bowl, toss lettuce, red onion, pepperoncini, Italian dressing, and oregano. Season with salt and pepper. Arrange salad on top of the toasted sandwich. Dollop with a bit of mayo (optional but I love it).\nFinish\nPress the top part of the focaccia over the sandwich and cut into wedges! WHOA NELLY that’s good. It’s juicy, crispy, salty, dense, and everything I want in a sandwich!",
    "image": "https://pinchofyum.com/tachyon/Focaccia-Grinder-Sandwich.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "321 calories",
      "sugarContent": "3.5 g",
      "sodiumContent": "934.8 mg",
      "fatContent": "26.2 g",
      "saturatedFatContent": "7.9 g",
      "transFatContent": "0 g",
      "carbohydrateContent": "10.6 g",
      "fiberContent": "3 g",
      "proteinContent": "11.8 g",
      "cholesterolContent": "31.7 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/marry-me-chickpeas-and-orzo",
    "title": "Marry Me Chickpeas and Orzo",
    "ingredients": [
      "2 tablespoons olive oil (this is the one I use)",
      "1 shallot, thinly sliced",
      "4 cloves garlic, thinly sliced",
      "1 (15 ounce) can chickpeas, drained",
      "2 tablespoons tomato paste",
      "1 cup orzo (love this DeLallo orzo!)",
      "3 cups chicken broth (I use 3 cups water + 3 teaspoons Better Than Bouillon)",
      "a small bundle of fresh thyme",
      "1/2 cup heavy cream",
      "1/4 cup jarred sun-dried tomatoes, tomato bruschetta (my favorite!), Calabrian chiles, or similar",
      "1-2 cups fresh spinach, torn into pieces",
      "parmesan, red pepper flakes, and more thyme for topping"
    ],
    "instructions": "Aromatics and Chickpeas\nHeat the oil in a large skillet over medium heat. Add the shallot and the garlic; sauté for 2-3 minutes until soft and fragrant. Add the chickpeas and tomato paste; sauté for another 2-3 minutes until it has developed a deeper red color.\nCook Orzo\nAdd the orzo, chicken broth, and thyme sprigs; bring to a low simmer. Cover and cook for 7-9 minutes.\nFinish Sauce\nRemove the thyme sprigs. Keep the heat on low. Stir in the cream and simmer for 2-3 more minutes, until it’s totally luscious and creamy. Taste and adjust seasonings, adding more cream if you want.\nAdd-Ins\nAdd your sun dried or fresh tomatoes and spinach, and stir them in until the spinach is wilted. Serve sprinkled with fresh herbs (I like thyme) and Parmesan.",
    "image": "https://pinchofyum.com/uploads/Marry-Me-Orzo-960x1259.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "348 calories",
      "sugarContent": "3.5 g",
      "sodiumContent": "985.1 mg",
      "fatContent": "16.1 g",
      "saturatedFatContent": "4.9 g",
      "transFatContent": "0.2 g",
      "carbohydrateContent": "41.8 g",
      "fiberContent": "6.3 g",
      "proteinContent": "11.5 g",
      "cholesterolContent": "20.7 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/miso-peanut-ramen-bowls",
    "title": "Miso Peanut Ramen Bowls",
    "ingredients": [
      "1 block extra firm tofu (I like the high protein tofu from Trader Joe’s, but any firm tofu will work)",
      "1 tablespoon olive oil",
      "1/4 cup teriyaki (I use Bachan’s Japanese BBQ sauce)",
      "1 clove garlic, grated",
      "1 tablespoon red curry paste or roasted red chili paste",
      "1 tablespoon white miso",
      "1-2 tablespoons peanut butter (just a little plop)",
      "2 tablespoons reduced sodium soy sauce",
      "1 tablespoon brown sugar",
      "1 1/2 cups water + 1 1/2 teaspoons Better Than Bouillon roasted chicken or vegetable base (sub 1 1/2 cups chicken or vegetable broth)",
      "1 (14-ounce) can full fat coconut milk",
      "6 ounces uncooked ramen noodles (two 3-ounce packets, just the noodles)",
      "Finely sliced cucumbers",
      "Cilantro and/or green onion",
      "Chili crisp"
    ],
    "instructions": "Prep Tofu\nPress tofu with paper towels to remove some of the water. Grate tofu on a box grater, on medium / large holes.\nCrisp Tofu\nHeat olive oil in a nonstick skillet over medium-high heat. Add the tofu shreds; saute until golden and lightly crisped (it usually takes me 10-15 minutes to really get it to have some crispy / chewy texture).\nSauce Tofu\nAdd the teriyaki sauce and grated garlic to the “thirsty” tofu. Sauté for another 5-10 minutes to caramelize further. Add 1-2 tablespoons more sauce as desired. Transfer to a separate bowl and wipe out the pan.\nMake Ramen Broth\nIn the same pan, heat the curry paste, miso, peanut butter, soy sauce, and brown sugar until it’s worked into a thick paste. Add the coconut milk and broth, and whisk until incorporated. Simmer for 5-10 minutes until slightly thickened and creamy.\nRamen\nMeanwhile, boil ramen in a separate pot for 3-4 minutes; drain, and add to sauce. Simmer 1-2 minutes until the noodles are well-coated (and add more broth if you want it to be more soupy).\nServe\nTransfer noodles into in bowls, and pour a scoop of the broth over the top. Top with the tofu, herbs, and chili crisp on top. She’s so yummy!",
    "image": "https://pinchofyum.com/tachyon/Miso-Peanut-Ramen-Bowls.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "549 calories",
      "sugarContent": "6.4 g",
      "sodiumContent": "1186.3 mg",
      "fatContent": "33.9 g",
      "saturatedFatContent": "20.4 g",
      "transFatContent": "0 g",
      "carbohydrateContent": "43.8 g",
      "fiberContent": "2.8 g",
      "proteinContent": "20.6 g",
      "cholesterolContent": "0 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/sheet-pan-breakfast-burritos-with-creamy-chipotle-sauce",
    "title": "Sheet Pan Breakfast Burritos with Creamy Chipotle Sauce",
    "ingredients": [
      "1 large russet potato, peeled and cubed (about 2 heaping cups – see notes for using hasbrowns)",
      "2 bell peppers, sliced",
      "half of a yellow onion, thinly sliced",
      "2 tablespoons olive oil",
      "1/2 teaspoon coarse kosher salt",
      "1/2 tablespoon Better Than Bouillon Roasted Garlic Base (optional, but great for flavor)",
      "12 eggs",
      "1/2 teaspoon coarse kosher salt",
      "1/2 tablespoon Better Than Bouillon Roasted Garlic Base (optional, but great for flavor)",
      "6 large tortillas (more or less depending on size of your tortilla)",
      "1 14-ounce can refried black beans",
      "7 ounces smoked gouda cheese, shredded",
      "1/2 cup cilantro, chopped (optional)",
      "salsa, or chipotle sauce for dipping (ingredients in notes!)"
    ],
    "instructions": "Veggies\nPreheat the oven to 425 degrees. Place potatoes, peppers, and onions on a half sheet pan. Toss with olive oil, salt, and Better Than Bouillon Roasted Garlic Base.\nRoast veggies for 20 minutes; stir, and roast for another 15-20 minutes until potatoes are done and peppers and onions are a little browned.\nEggs\nTurn oven temperature to 350 degrees. Whisk egg mixture; pour directly onto the sheet pan with the veggies. Bake for 7 minutes.\nBake\nPush the eggs gently around on the pan until “scrambled” a bit (they should still be a bit wet). Return to oven for 3-6 minutes until they’re set.\nBurritos\nFill tortillas with the egg mixture, refried beans, smoked gouda cheese, and cilantro. Wrap snugly in the tortilla, and roll it up in foil.\nStore\nFrom here, you can freeze them for up to 3 months, or keep them in the fridge for 3-4 days. See notes for reheating methods! Serve with salsa and/or chipotle sauce.\nOptions for Reheating:\nMicrowave\nUnwrap burrito (frozen or thawed) and place on a microwave safe plate. Microwave for 2-3 minutes. I flip it over halfway through to get it heated more evenly.\nOven\nBake the foil-wrapped burrito at 425 for 30 minutes (25-30 for thawed, 35-40 if still frozen). As long as it’s in the foil, you can just put it directly on an oven rack. I do this while I’m getting ready and then it’s steamy and warmed for me to eat just before I leave!\nAir Fryer or Skillet (for crispiness)\nSpritz the outside of the burrito with oil and air fry at 350 for 4 minutes. For a skillet, pan fry in a skillet over medium heat with some butter for 2 minutes per side until golden. This can be done with a warmed OR frozen burrito – in either case, it will make the exterior crispy. If you do it with a frozen burrito, you might need to give it an additional 1-2 minutes in the microwave to ensure it’s heated through after crisping.",
    "image": "https://pinchofyum.com/tachyon/Sheet-Pan-Breakfast-Burritos.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "588 calories",
      "sugarContent": "5.4 g",
      "sodiumContent": "1485.6 mg",
      "fatContent": "28.9 g",
      "saturatedFatContent": "10.8 g",
      "transFatContent": "0 g",
      "carbohydrateContent": "52.2 g",
      "fiberContent": "6 g",
      "proteinContent": "30.7 g",
      "cholesterolContent": "412.4 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/slow-cooker-chicken-pot-pie-soup",
    "title": "Slow Cooker Chicken Pot Pie Soup",
    "ingredients": [
      "2 boneless skinless chicken breasts",
      "salt and pepper",
      "half an onion, diced",
      "2-3 cloves garlic, minced",
      "a sprig of fresh rosemary (sub a small pinch of dried herbs)",
      "a spring of fresh thyme (sub a small pinch of dried herbs)",
      "32 oz chicken broth",
      "1 large russet potato, peeled and diced",
      "1 package frozen peas and carrots (2-3 cups)",
      "2 tablespoons flour",
      "1 cup of heavy cream",
      "3 tablespoons cornstarch",
      "fresh chopped parsley",
      "1 thawed sheet of puff pastry"
    ],
    "instructions": "Slow Cook\nPlace the chicken, salt and pepper, onion, garlic, rosemary, thyme, broth, potato, and pea/carrot mix in a slow cooker. Cook on high for 3 hours. Remove the chicken, shred, and return to pot. Remove the herb sprigs and discard.\nMake it Creamy\nWhisk the flour and cream together until smooth. Add to the slow cooker. Keep on high heat for another hour or so. For a thicker soup, whisk the cornstarch with a little bit of cold water and add it to warm soup in the slow cooker.\nBake the Puff Toppers:\nCut your puff pastry into triangles, circles, or hearts! Bake as directed (we did 375 for 10-15 minutes).\nServe\nStir the parsley into the soup to add a little fresh color. Divide the soup among bowls and top with the puff pastry. Yummy!",
    "image": "https://pinchofyum.com/tachyon/Chicken-Pot-Pie-Soup-1-4-Yoast.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "522 calories",
      "sugarContent": "3 g",
      "sodiumContent": "787.9 mg",
      "fatContent": "31.7 g",
      "saturatedFatContent": "11.7 g",
      "transFatContent": "0.5 g",
      "carbohydrateContent": "43.8 g",
      "fiberContent": "3.4 g",
      "proteinContent": "17.1 g",
      "cholesterolContent": "75.7 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/sticky-beef-and-peanut-noodles",
    "title": "Caramelized Beef and Peanut Noodles",
    "ingredients": [
      "1 lb. ground beef",
      "1 tablespoon avocado oil",
      "2 teaspoons cornstarch",
      "1/3 cup teriyaki sauce (I used Bachan’s)",
      "1 clove garlic, grated",
      "⅓ cup peanut butter",
      "⅓ cup soy sauce",
      "1/4 cup warm water",
      "2 tablespoons rice vinegar",
      "2 tablespoons sesame oil",
      "1-2 tablespoons sugar",
      "1 tablespoon chili garlic sauce",
      "5 green onions, thinly sliced (green saved for garnish)",
      "2-3 cups sliced stir-fry veggies (I like red bell pepper, spinach, and basil leaves)",
      "6-ounce package stir-fry egg noodles (I use the Wel-Pac chow mein stir fry noodles)",
      "Black pepper for serving"
    ],
    "instructions": "Peanut Sauce\nBlend the sauce until smooth and creamy.\nCook Beef\nHeat avocado oil in a pan over high heat; add ground beef and leave undisturbed for several minutes to get some browned spots. Break apart with a wooden spoon into small pieces.\nCaramelize the Beef\nAdd the cornstarch and quickly stir fry for 15-30 seconds. Then add garlic and teriyaki for a minute or so; it will sizzle and start to caramelize, plus it’ll smell amazing. Remove from pan, set aside and cover or place in a 350 degree oven to keep it warm.\nSauté Veggies\nIn the same pan, sauté the white parts of the green onions and the veggies (adding more oil as needed).\nCook Noodles\nBoil noodles for 3 minutes or according to package directions; rinse with cold water to prevent stickiness.\nToss Together\nAdd cooked noodles and most of the peanut sauce to the veggies in the skillet; toss to combine for 1-2 minutes (you’ll want to serve immediately while it’s still hot and silky).\nFinish\nPlate noodles; add a scoop of beef on top. Garnish with green onions and lots of black pepper, and drizzle with remaining peanut sauce if you want!",
    "image": "https://pinchofyum.com/tachyon/Sticky-Beef-with-Peanut-Noodles.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "605 calories",
      "sugarContent": "14.2 g",
      "sodiumContent": "1251.1 mg",
      "fatContent": "27.6 g",
      "saturatedFatContent": "5.8 g",
      "transFatContent": "0.2 g",
      "carbohydrateContent": "51.3 g",
      "fiberContent": "4.5 g",
      "proteinContent": "39.2 g",
      "cholesterolContent": "102.6 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/teriyaki-tofu-bowls-with-kimchi-mayo",
    "title": "Teriyaki Tofu Bowls with Kimchi Mayo",
    "ingredients": [
      "1 block extra-firm tofu",
      "2 tablespoons avocado oil",
      "1/4 cup teriyaki sauce (more to taste)",
      "1 clove garlic, grated or minced",
      "1/2 cup kewpie mayo",
      "3/4 cup kimchi, chopped finely",
      "salt and pepper to taste",
      "1-2 cups steamed jasmine rice",
      "1-2 cups steamed broccoli",
      "4 green onions, thinly sliced (green parts)"
    ],
    "instructions": "Prep Tofu\nDrain and press the tofu with a few paper towels to remove some of the moisture. (I use the high protein tofu from Trader Joe’s and it needs almost no pressing!)\nGrate Tofu\nGently grate the tofu on a box grater so you get medium shreds.\nFry Tofu\nHeat the oil over medium high heat in a nonstick pan. Add shredded tofu and pan-fry for 10-15 minutes, stirring occasionally, until browned a little bit crisped.\nRice, Broccoli, and Sauce\nThe tofu takes a bit, so while it’s cooking, prep your rice and broccoli. Mix the kimchi and mayo to make a sauce. Season to taste.\nFinish Tofu\nAdd the teriyaki sauce and grated garlic to the crisped tofu in the hot pan. Let it sizzle for a minute on medium heat. (It’ll smell amazing when the garlic hits!)\nServe the tofu over rice, with broccoli and a dollop of the kimchi mayo. I like to finish it off with green onions, more teriyaki sauce, and a spicy sprinkle like togarashi!",
    "image": "https://pinchofyum.com/tachyon/Teriyaki-Tofu-1.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "437 calories",
      "sugarContent": "4 g",
      "sodiumContent": "942.2 mg",
      "fatContent": "33.1 g",
      "saturatedFatContent": "4.8 g",
      "transFatContent": "0.1 g",
      "carbohydrateContent": "21.6 g",
      "fiberContent": "2.5 g",
      "proteinContent": "13.5 g",
      "cholesterolContent": "11.6 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/the-best-avocado-egg-salad",
    "title": "The Best Avocado Egg Salad",
    "ingredients": [
      "2 avocados",
      "8 eggs",
      "a handful of dill",
      "a handful of parsley",
      "juice of one lemon",
      "a pinch of salt",
      "a drizzle of olive oil (as needed)"
    ],
    "instructions": "Hard boil the eggs.\nCover the eggs with water in a saucepan. Bring to a boil, turn heat off, cover and rest (on hot burner) for 8-10 minutes. Run under cold water and break off the shells. Cut the eggs into small pieces.\nMash the avocados in a bowl with the back of a large wooden spoon until mostly smooth.\nMix and serve\nMix the eggs with the avocados, herbs, lemon juice, salt, and olive oil if you need it. Serve immediately at room temperature, or chill and serve cold.",
    "image": "https://pinchofyum.com/tachyon/Avocado-Egg-Salad-3-Yoast.jpg",
    "yields": "5 servings",
    "nutrients": {
      "calories": "265 calories",
      "sugarContent": "3.6 g",
      "sodiumContent": "234.5 mg",
      "fatContent": "19.9 g",
      "saturatedFatContent": "4.9 g",
      "transFatContent": "0 g",
      "carbohydrateContent": "11.4 g",
      "fiberContent": "7.2 g",
      "proteinContent": "13 g",
      "cholesterolContent": "297.6 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/the-best-soft-chocolate-chip-cookies",
    "title": "The Best Soft Chocolate Chip Cookies",
    "ingredients": [
      "8 tablespoons of salted butter",
      "1/2 cup white sugar (I like to use raw cane sugar with a coarser texture)",
      "1/4 cup packed light brown sugar",
      "1 teaspoon vanilla",
      "1 egg",
      "1 1/2 cups all purpose flour (6.75 ounces)",
      "1/2 teaspoon baking soda",
      "1/4 teaspoon salt (but I always add a little extra)",
      "3/4 cup chocolate chips (I use a combination of chocolate chips and chocolate chunks)"
    ],
    "instructions": "Preheat the oven to 350 degrees. Microwave the butter for about 40 seconds to just barely melt it. It shouldn’t be hot – but it should be almost entirely in liquid form.\nUsing a stand mixer or electric beaters, beat the butter with the sugars until creamy. Add the vanilla and the egg; beat on low speed until just incorporated – 10-15 seconds or so (if you beat the egg for too long, the cookies will be stiff).\nAdd the flour, baking soda, and salt. Mix until crumbles form. Use your hands to press the crumbles together into a dough. It should form one large ball that is easy to handle (right at the stage between “wet” dough and “dry” dough). Add the chocolate chips and incorporate with your hands.\nRoll the dough into 12 large balls (or 9 for HUGELY awesome cookies) and place on a cookie sheet. Bake for 9-11 minutes until the cookies look puffy and dry and just barely golden. Warning, friends: DO NOT OVERBAKE. This advice is probably written on every cookie recipe everywhere, but this is essential for keeping the cookies soft. Take them out even if they look like they’re not done yet (see picture in the post). They’ll be pale and puffy.\nLet them cool on the pan for a good 30 minutes or so (I mean, okay, eat four or five but then let the rest of them cool). They will sink down and turn into these dense, buttery, soft cookies that are the best in all the land. These should stay soft for many days if kept in an airtight container. I also like to freeze them.",
    "image": "https://pinchofyum.com/tachyon/Chocolate-Chip-Cookies-Recipe.jpg",
    "yields": "12 servings",
    "nutrients": {
      "calories": "250 calories",
      "sugarContent": "20.5 g",
      "sodiumContent": "169.3 mg",
      "fatContent": "12.2 g",
      "saturatedFatContent": "7.5 g",
      "transFatContent": "0.3 g",
      "carbohydrateContent": "33.4 g",
      "fiberContent": "1.4 g",
      "proteinContent": "3.2 g",
      "cholesterolContent": "35.9 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/trader-joes-chicken-shawarma-with-lemon-rice",
    "title": "Chicken Shawarma with Lemon Rice",
    "ingredients": [
      "1 package Trader Joe’s chicken shawarma (or see notes making the chicken from scratch!)",
      "1 1/2 cups long-grain white rice",
      "1 teaspoon each onion powder and garlic powder",
      "1/2 teaspoon kosher salt",
      "1 tablespoon Better Than Bouillon chicken base",
      "2 1/4 cups water",
      "zest of 1 lemon",
      "2 cups finely shredded purple cabbage",
      "1/4 cup white vinegar",
      "1/4 cup water",
      "2 tablespoons olive oil",
      "½ teaspoon each salt and sugar",
      "1/2 cucumber, grated and water squeezed out",
      "¼ cup plain Greek yogurt",
      "2 tablespoons olive oil or mayo",
      "¼ cup crumbled feta cheese",
      "1 clove garlic, grated",
      "1 teaspoon dried dill, or 3 tablespoons fresh dill"
    ],
    "instructions": "Make Lemon Rice\nThoroughly rinse rice in a colander. Add rice to a medium sized pot and add onion powder, garlic powder, salt, Better than Bouillon, and water. Stir well, then bring everything to a simmer. Cover the pot, and keep it on a very low simmer for 18 minutes. When it’s done, add lemon zest; fluff with a fork.\nToss Cabbage Salad\nToss together cabbage, white vinegar, water, olive oil, salt, and sugar; taste and adjust. Let it rest while you finish up.\nMake Feta Cucumber Sauce\nStir together grated cucumber, Greek yogurt, olive oil or mayo, feta cheese, garlic, and dill; taste and adjust.\nAir Fry Chicken Shawarma\nI do this last so it’s hot and fresh! Air fry the chicken at 390 degrees F for 9-10 minutes, until 165 degrees and deeply browned on the outside. (You can also cook the chicken on a sheet pan in the oven – place rack in the top 1/3 of your oven. Bake chicken at 450 degrees F for 15 minutes, then broil on low for 3-5 more minutes, until browned). Let rest a few minutes. Chop into bite-sized pieces.\nServe\nPlate rice with the chopped chicken shawarma, a scoop of the cabbage, and a dollop of the feta cucumbers.",
    "image": "https://pinchofyum.com/tachyon/Chicken-Shawarma-Bowls-17.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "453 calories",
      "sugarContent": "3.8 g",
      "sodiumContent": "733.7 mg",
      "fatContent": "17.9 g",
      "saturatedFatContent": "4.1 g",
      "transFatContent": "0 g",
      "carbohydrateContent": "62.7 g",
      "fiberContent": "2.3 g",
      "proteinContent": "10.2 g",
      "cholesterolContent": "16.9 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/vegan-crunchwrap",
    "title": "Vegan Crunchwrap Supreme",
    "ingredients": [
      "3 tablespoons olive oil",
      "16 ounces extra firm tofu (press out some liquid first)",
      "2 tablespoons taco seasoning (add about 1 teaspoon salt if it’s unsalted)",
      "2 chipotle peppers, minced",
      "1/3 to 1/2 cup salsa",
      "1 cup cashews",
      "1/2 cup water",
      "1 can diced green chiles (or less, to taste)",
      "1 teaspoon taco seasoning (add a pinch of salt if it’s unsalted)",
      "huge burrito-sized flour tortillas",
      "something crunchy: tostadas or tortilla chips",
      "roasted vegetables",
      "black beans",
      "avocados",
      "fresh stuff: tomatoes, cabbage slaw, lettuce, cilantro",
      "salsa"
    ],
    "instructions": "Sofritas Tofu\nHeat oil over medium high heat in a large nonstick skillet. Add tofu and break apart into crumbles. Add taco seasoning, salt, chipotles, and salsa. Get it all going in the pan, nice and hot. Finish by letting everything sit without stirring for another 10+ minutes (adding oil to prevent sticking as needed) until you get some nice browned, almost-crunchy pieces.\nCashew Queso\nBlend everything together aggressively until smooth!\nCrunch Wrap Time\nLay a large tortilla on a flat surface. Layer: tofu, queso, crunchy stuff, and any other extras you want in there. Fold in the edges of the tortilla toward the center. Place in a hot oiled skillet, seam side down. Cook for a few minutes on each side until the exterior is firm, crunchy, and golden brown. Cut and serve!",
    "image": "https://pinchofyum.com/tachyon/Vegan-Crunchwrap-Feature.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "545 calories",
      "sugarContent": "5.5 g",
      "sodiumContent": "1011.9 mg",
      "fatContent": "26.7 g",
      "saturatedFatContent": "4.2 g",
      "transFatContent": "0 g",
      "carbohydrateContent": "59.1 g",
      "fiberContent": "4.6 g",
      "proteinContent": "17.9 g",
      "cholesterolContent": "0 mg"
    }
  },
  {
    "url": "https://pinchofyum.com/zuppa-toscana",
    "title": "Zuppa Toscana",
    "ingredients": [
      "1 tablespoon olive oil",
      "1 lb. ground mild Italian pork sausage",
      "1 onion, finely diced",
      "3 cloves garlic, minced",
      "2 medium russet potatoes, peeled and cubed (about 3-4 cups)",
      "6 cups chicken broth (see notes)",
      "2 stalks of kale, stems removed, finely chopped (2-3 cups)",
      "3/4 cup heavy cream",
      "salt and pepper to taste",
      "freshly grated Parmesan to taste, for topping",
      "1 loaf crusty bread, with butter (this one is so easy – or just a store-bought take-and-bake loaf!)"
    ],
    "instructions": "Sausage\nHeat the oil in a large Dutch oven (affiliate link) over medium high heat. Brown the sausage until fully cooked.\nOnions and Garlic\nAdd the onions and garlic to the sausage. Sauté for 5-7 minutes until soft and fragrant. FYI your house will smell AMAZING.\nPotatoes and Broth\nAdd the potatoes and the broth. Simmer for 7-10 minutes, until the potatoes are tender. (Be careful not to let it go for too long, because the potatoes will start to get really soft.)\nFinish with Cream\nAdd the kale and heavy cream. Simmer for 5 minutes until kale has wilted.\nServe\nSeason with salt and pepper, top with Parmesan for even more flavor, and dunk into that glorious broth with hot crusty bread.",
    "image": "https://pinchofyum.com/tachyon/Zuppa-Toscana-Soup.jpg",
    "yields": "5 servings",
    "nutrients": {
      "calories": "357 calories",
      "sugarContent": "2.9 g",
      "sodiumContent": "990.9 mg",
      "fatContent": "24.7 g",
      "saturatedFatContent": "10 g",
      "transFatContent": "0.2 g",
      "carbohydrateContent": "17 g",
      "fiberContent": "1.5 g",
      "proteinContent": "17.2 g",
      "cholesterolContent": "77.1 mg"
    }
  },
  {
    "url": "https://www.allrecipes.com/recipe/151595/campbells-green-bean-casserole/",
    "title": "Campbell's Green Bean Casserole",
    "ingredients": [
      "2.6666667461395 cups French's® French Fried Onions",
      "8 cups cooked cut green beans",
      "2 (10.75 ounce) cans Campbell's® Condensed Cream of Mushroom Soup or Campbell's® Condensed 98% Fat Free Cream of Mushroom Soup",
      "1 cup milk",
      "2 teaspoons soy sauce",
      "0.25 teaspoon ground black pepper"
    ],
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nStir 1 1/3 fried onions, green beans, soup, milk, soy sauce, and pepper together in a 3-quart casserole dish.\nBake in the preheated oven until hot, about 25 minutes.\nStir casserole; top with remaining 1 1/3 cups fried onions. Bake 5 minutes more.",
    "image": "https://www.allrecipes.com/thmb/GMjVlmWXRMGPuIK2FRh8MBvIXgA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/AR-151595-Campbells-green-bean-casserole-DDMFS-4x3-49f408d95f4d40a39cb14ce6fa9544a5.jpg",
    "yields": "12 servings",
    "nutrients": {}
  },
  {
    "url": "https://www.allrecipes.com/recipe/25199/sweet-and-sour-meatballs-suan-tien-niu-jou-po-lo-la-tzu/",
    "title": "Sweet and Sour Meatballs (Suan T'ien Niu Jou Po Lo La Tzu)",
    "ingredients": [
      "1 pound ground beef",
      "1 egg",
      "1 tablespoon cornstarch",
      "1 teaspoon salt",
      "4 tablespoons diced onion",
      "1 pinch ground black pepper",
      "1 tablespoon vegetable oil",
      "1 cup pineapple juice",
      "3 tablespoons cornstarch",
      "1 tablespoon soy sauce",
      "3 tablespoons distilled white vinegar",
      "6 tablespoons water",
      "0.5 cup granulated sugar",
      "4 slices fresh pineapple, cut into pieces",
      "1 large green bell pepper, cut into thin strips",
      "0.25 carrot, thinly sliced",
      "0.33333334326744 onion, cut into wedges and separated"
    ],
    "instructions": "In a mixing bowl, combine the ground beef, egg, cornstarch, salt, diced onion and pepper. Form into 1-inch meatballs; you'll get about 20 total.\nIn a large skillet over medium heat, brown the meatballs; drain fat and set aside.\nHeat the oil in a large saucepan over low heat. Pour in the pineapple juice and simmer for a few minutes.\nIn a small bowl, combine the 3 tablespoons of cornstarch, soy sauce, vinegar and water. Stir until smooth and pour into the pineapple juice. Add the sugar and simmer until thickened, stirring constantly.\nPlace the meatballs, pineapple pieces, green pepper, carrot and onion into the sauce mixture. Heat thoroughly.",
    "image": "https://www.allrecipes.com/thmb/aGQOKe0LMs8eX7r4xpWu3PsuBBI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/335643_Sweet-and-Sour-Meatballs-Suan-Tien-Niu-Jou-Po-Lo-La-Tzu-4x3-2d23cbb3f4f64fc69a7e19ff3d6ce48f.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "341 kcal",
      "carbohydrateContent": "38 g",
      "cholesterolContent": "77 mg",
      "fiberContent": "2 g",
      "proteinContent": "15 g",
      "saturatedFatContent": "5 g",
      "sodiumContent": "599 mg",
      "sugarContent": "28 g",
      "fatContent": "15 g",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/baked_ziti/",
    "title": "Baked Ziti",
    "ingredients": [
      "1 pound ziti (can sub penne) pasta",
      "Kosher salt",
      "Extra virgin olive oil",
      "1 pound bulk Italian sausage or ground beef or pork",
      "1 large onion, chopped",
      "3-4 garlic cloves, chopped",
      "1 tablespoon fresh rosemary (or basil), minced",
      "1 tablespoon Italian seasoning",
      "1/2 teaspoon red pepper flakes",
      "1 large jar of marinara sauce (about 32 ounces) or make your own tomato sauce",
      "Salt and pepper to taste",
      "1/2 pound of mozzarella cheese, grated or shredded",
      "1 cup grated parmesan or pecorino cheese",
      "1 heaping cup of ricotta cheese"
    ],
    "instructions": "Preheat the oven to 350°F.\nCook the pasta: Heat a large pot of salted water (for every 2 quarts of water, one tablespoon of salt) to a strong boil. Add the pasta and cook at a rolling boil, uncovered, until the pasta is al dente—edible but still a little firm to the bite. Drain the pasta through a colander. Toss with a little olive oil so the pasta does not stick together while you make the sauce.\nBrown the meat: While the water is heating in the previous step, start on the sauce. Heat a tablespoon of olive oil in a large sauté pan on medium-high heat. When the oil is shimmering hot, add the bulk sausage or ground meat. Break up any large chunks of sausage as it cooks. Brown well. Don't stir that often or it will be more difficult for the meat to brown. If you are using ground beef or pork instead of sausage, sprinkle with a little salt.\nMake the sauce: When the meat is mostly browned, add the onions and stir well to combine. Sauté everything until the onions are translucent and beginning to brown, about 4 to 5 minutes. Add the garlic, rosemary or basil, Italian seasoning, and red pepper flakes and stir to combine. Cook 1 minute, then add the tomato sauce and stir well. Bring to a simmer. Taste the sauce and season with salt and pepper, if needed.\nAssemble the casserole: Spread a thin layer of the sauce in the bottom of a 9x13-inch casserole pan, then dot the surface with half the ricotta cheese. Ladle a spoonful of sauce into the pasta, stir it well and then add the pasta into the casserole. Pour the rest of the sauce over the pasta, dot the remaining ricotta cheese over the pasta, and sprinkle on top both the mozzarella and the Parmesan cheese. At this point, you can cool, cover, and refrigerate or freeze to make ahead.\nBake: Bake uncovered in the oven at 350°F until the top is lightly browned and the cheese melted, about 20 to 25 minutes. Let stand for 10 minutes before serving. Did you love the recipe? Give us some stars and leave a comment below!",
    "image": "https://www.simplyrecipes.com/thmb/O1ZqsMeMBqY0Pz0QnPl_sUEx75Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Baked-Ziti-LEAD-6-dfb217b71c59430e8824405763c39e48.jpg",
    "yields": "8 servings",
    "nutrients": {
      "calories": "557 kcal",
      "carbohydrateContent": "36 g",
      "cholesterolContent": "78 mg",
      "fiberContent": "4 g",
      "proteinContent": "30 g",
      "saturatedFatContent": "14 g",
      "sodiumContent": "1510 mg",
      "sugarContent": "9 g",
      "fatContent": "32 g",
      "servingSize": "Serves at least 8",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/banana_bread/",
    "title": "Banana Bread",
    "ingredients": [
      "2 to 3 very ripe bananas, peeled (about 1 1/4 to 1 1/2 cups mashed)",
      "1/3 cup melted butter, unsalted or salted",
      "1 teaspoon baking soda",
      "Pinch of salt",
      "3/4 cup sugar (1/2 cup if you would like it less sweet, 1 cup if more sweet)",
      "1 large egg, beaten",
      "1 teaspoon vanilla extract",
      "1 1/2 cups of all-purpose flour"
    ],
    "instructions": "Preheat the oven to 350°F (175°C): Butter an 8x4-inch loaf pan.\nMash the bananas and add the butter: In a mixing bowl, mash the ripe bananas with a fork until completely smooth. Stir the melted butter into the mashed bananas.\nMix in the remaining ingredients: Mix in the baking soda and salt. Stir in the sugar, beaten egg, and vanilla extract. Mix in the flour.\nBake the bread: Pour the batter into your prepared loaf pan. Bake for 55 to 65 minutes at 350°F (175°C), or until a toothpick or wooden skewer inserted into the center comes out clean. A few dry crumbs are okay; streaks of wet batter are not. If the outside of the loaf is browned but the center is still wet, loosely tent the loaf with foil and continue baking until the loaf is fully baked.\nCool and serve: Remove from oven and let cool in the pan for a few minutes. Then remove the banana bread from the pan and let cool completely before serving. Slice and serve. (A bread knife helps to make slices that aren't crumbly.) Wrapped well, the banana bread will keep at room temperature for 4 days. For longer storage, refrigerate the loaf up to 5 days, or freeze it.",
    "image": "https://www.simplyrecipes.com/thmb/tR-5eHAZ3lgNR6Yvu3yxdHMNpk8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Easy-Banana-Bread-LEAD-2-2-63dd39af009945d58f5bf4c2ae8d6070.jpg",
    "yields": "10 servings",
    "nutrients": {
      "calories": "220 kcal",
      "carbohydrateContent": "37 g",
      "cholesterolContent": "35 mg",
      "fiberContent": "1 g",
      "proteinContent": "3 g",
      "saturatedFatContent": "4 g",
      "sodiumContent": "85 mg",
      "sugarContent": "19 g",
      "fatContent": "7 g",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/cilantro_lime_rice/",
    "title": "Cilantro Lime Rice",
    "ingredients": [
      "2 tablespoons extra virgin olive oil",
      "1 1/2 cups basmati long grain white rice",
      "1 clove garlic, minced",
      "2 1/4 cup water",
      "1 teaspoon salt",
      "Zest of one lime",
      "3 tablespoons lime juice",
      "1 cup lightly packed chopped cilantro, leaves and tender stems"
    ],
    "instructions": "Brown the rice: Heat the olive oil in a medium saucepan on medium high heat. Add the raw rice and stir to coat with the olive oil. Cook, stirring occasionally, until the rice has started to brown. Add the garlic and cook a minute more. Simply Recipes / Elise Bauer\nAdd water, salt, zest, then simmer: Add water, salt, and lime zest to the rice. Bring to a rolling boil, then cover and lower the heat to low to maintain a very low simmer. Simply Recipes / Elise BauerSimply Recipes / Elise Bauer Cook undisturbed for 15 minutes (check your rice package instructions), then remove from heat and let sit for 10 minutes. Fluff the rice with a fork.\nStir in lime juice and cilantro: Transfer the rice to a serving bowl. Pour lime juice over the rice and toss with chopped cilantro. Simply Recipes / Elise Bauer Serve with chicken, steak, shrimp, Mexican or Asian food. Did you enjoy this recipe? Let us know with a rating and review!",
    "image": "https://www.simplyrecipes.com/thmb/E41yWRY6M6-HkD-WtR7SmN3mIxY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Cilantro-Lime-Rice-LEAD-2-199aa395ee0642d1ac396cbf3dc8b8a9.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "230 kcal",
      "carbohydrateContent": "43 g",
      "cholesterolContent": "0 mg",
      "fiberContent": "1 g",
      "proteinContent": "4 g",
      "saturatedFatContent": "1 g",
      "sodiumContent": "360 mg",
      "sugarContent": "1 g",
      "fatContent": "5 g",
      "servingSize": "Serves 6",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/easy_shepherds_pie/",
    "title": "Easy Shepherd's Pie",
    "ingredients": [
      "1 teaspoon salt, plus more to taste",
      "1 1/2 to 2 pounds potatoes (about 3 large potatoes), peeled and quartered",
      "8 Tablespoons (1 stick) butter",
      "1 medium onion, chopped (about 1 1/2 cups)",
      "1-2 cups vegetables—diced carrots, corn, peas",
      "1 1/2 lbs ground round beef",
      "1/2 cup beef broth",
      "1 teaspoon Worcestershire sauce",
      "Salt, pepper, other seasonings of choice"
    ],
    "instructions": "Boil the potatoes: Place the peeled and quartered potatoes in medium sized pot. Cover with at least an inch of cold water. Add a teaspoon of salt. Bring to a boil, reduce to a simmer, and cook until tender (about 20 minutes).\nPreheat the oven to 400°F.\nSauté the vegetables: While the potatoes are cooking, melt 4 tablespoons of the butter in a large sauté pan on medium heat. Add the chopped onions and cook until tender, about 6 to 10 minutes. If you are including vegetables, add them according to their cooking time. Carrots should be cooked with the onions, because they take as long to cook as the onions do. If you are including peas or corn, add them toward the end of the cooking of the onions, or after the meat starts to cook, as they take very little cooking time. Simply Recipes / Cambrea Gordon\nAdd the ground beef, then the Worcestershire sauce and broth: Add ground beef to the pan with the onions and vegetables. Cook until no longer pink. Drain the pan of excess fat, if necessary (anything more than 1 tablespoon). Season with salt and pepper. Add the Worcestershire sauce and beef broth. Bring the broth to a simmer and reduce heat to low. Cook uncovered for 10 minutes, adding more beef broth if necessary to keep the meat from drying out. Taste the cooked filling and, if needed, add more salt, pepper, Worcestershire, or other seasonings of your choice. Simply Recipes / Cambrea GordonSimply Recipes / Cambrea Gordon\nMash the cooked potatoes: When the potatoes are done cooking (a fork can easily pierce), remove them from the pot and place them in a bowl with the remaining 4 tablespoons of butter. Mash with a fork or potato masher, taste, and adjust seasonings with salt and pepper. Simply Recipes / Cambrea Gordon\nLayer the meat mixture and mashed potatoes in a casserole dish: Spread the cooked filling in an even layer in a large baking dish (such as a 9 x 13-inch casserole. Spread the mashed potatoes over the top of the ground beef. Rough up the surface of the mashed potatoes with a fork so there are peaks that will get well browned. You can even use a fork to make creative designs in the mashed potatoes. Simply Recipes / Cambrea GordonSimply Recipes / Cambrea Gordon\nBake: Place in a 400°F oven and cook until browned and bubbling, about 30 minutes. If necessary, broil for the last few minutes to help the surface of the mashed potatoes brown. (Be careful when broiling using Pyrex or glass dishes, they have been known to shatter under the high heat of the broiler. It's not a worry if you are using a ceramic or metal casserole dish.) Did you love the recipe? Leave a comment and give us some stars below! Simply Recipes / Cambrea Gordon",
    "image": "https://www.simplyrecipes.com/thmb/esY4hhLlEgWMG0q9kOvbDZ24Px0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Easy-Shepherds-Pie-Lead-2_SERP-fdf8883477354e85bd05f9243f71657f.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "865 kcal",
      "carbohydrateContent": "51 g",
      "cholesterolContent": "212 mg",
      "fiberContent": "7 g",
      "proteinContent": "54 g",
      "saturatedFatContent": "25 g",
      "sodiumContent": "1031 mg",
      "sugarContent": "6 g",
      "fatContent": "50 g",
      "servingSize": "Serves 4",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/french_onion_soup/",
    "title": "French Onion Soup",
    "ingredients": [
      "6 large red or yellow onions (about 3 pounds), peeled and thinly sliced root to stem (see How to Slice an Onion), about 10 cups of sliced onions total",
      "4 tablespoons extra virgin olive oil",
      "2 tablespoons butter",
      "1 teaspoon of sugar",
      "Salt",
      "2 cloves garlic, minced",
      "8 cups of beef stock, chicken stock, or a combination of the two (traditionally the soup is made with beef stock)",
      "1/2 cup of dry vermouth or dry white wine",
      "2 bay leaves",
      "1 tablespoon (loose) of fresh thyme (can also use a few sprigs of fresh thyme) OR 1/2 teaspoon dried thyme (more to taste)",
      "1/2 teaspoon freshly ground black pepper",
      "2 tablespoons brandy (optional)",
      "8 slices French bread or baguette cut 1-inch thick",
      "1 1/2 cups of grated Swiss Gruyere and a sprinkling of Parmesan",
      "Sprinkling of Parmesan"
    ],
    "instructions": "Peel and slice the onions: Peel and thinly slice the onions from root to stem. There should be about 10 cups of sliced onions in total. Simply Recipes / Cambrea Bakes\nBegin caramelizing the onions with olive oil and butter: In a 5 to 6 quart thick-bottomed pot, heat 3 tablespoons of olive oil on medium heat. Add the onions and toss to coat with the olive oil. Cook the onions, stirring often, until they have softened, about 15 to 20 minutes. Increase the heat to medium high. Add the remaining tablespoon of olive oil and the butter and cook, stirring often, until the onions start to brown, about 20 to 40 minutes. The amount of time will vary depending on your pot, stove, and onions. Simply Recipes / Elise Bauer\nSprinkle with the sugar, finish caramelizing, and add garlic: Sprinkle with sugar (to help with the caramelization) and 1 teaspoon of salt. Continue to cook until the onions are well browned, about 10 to 15 more minutes. Add the minced garlic and cook for a minute more. Simply Recipes / Elise Bauer\nDeglaze the pot with vermouth or wine: Add the wine or vermouth to the pot and scrape up the browned bits on the bottom and sides of the pot, deglazing the pot as you go. Simply Recipes / Elise Bauer\nAdd the stock, bay leaves, and thyme: Add the stock, bay leaves, and thyme. Bring to a simmer, cover the pot and lower the heat to maintain a low simmer. Cook for about 30 minutes. Simply Recipes / Elise BauerSimply Recipes / Elise Bauer\nSeason and add the brandy: Season to taste with more salt and add freshly ground black pepper. Discard the bay leaves. Add brandy if using.\nToast the French bread slices: While the soup is simmering, line a sheet pan with parchment paper or foil and preheat the oven to 450°F with a rack in the upper third of the oven. Brush both sides of the French bread or baguette slices lightly with olive oil (you'll end up using about a tablespoon and a half of olive oil for this). Put in the oven and toast until lightly browned, about 5 to 7 minutes. Remove from oven. Simply Recipes / Elise BauerSimply Recipes / Elise Bauer Turn the toasts over and sprinkle with the grated Gruyere cheese and Parmesan. Return to oven when it's close to serving time and bake until the cheese is bubbly and lightly browned.\nServe: To serve, ladle soup into a bowl and transfer one cheesy toast onto the top of each bowl of soup. Alternatively, you can use individual oven-proof bowls or one large casserole dish. Ladle the soup into the bowls or casserole dish. Cover with the toast and sprinkle with cheese. Put into the broiler for 10 minutes at 350° F, or until the cheese bubbles and is slightly browned. Did you enjoy this recipe? Let us know with a rating and review!",
    "image": "https://www.simplyrecipes.com/thmb/SY2lL2neXpYOvkxhYvoUcl6pXLQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-French-Onion-Soup-LEAD-2-757941da129647dc90e490ed72b3807c.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "699 kcal",
      "carbohydrateContent": "84 g",
      "cholesterolContent": "43 mg",
      "fiberContent": "5 g",
      "proteinContent": "30 g",
      "saturatedFatContent": "10 g",
      "sodiumContent": "1727 mg",
      "sugarContent": "14 g",
      "fatContent": "26 g",
      "servingSize": "Serves 4-6",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/grilled_mexican_street_corn_elotes/",
    "title": "Grilled Mexican Street Corn (Elotes)",
    "ingredients": [
      "6 to 8 medium ears sweet corn, husks removed",
      "1/2 cup Mexican crema, or sour cream",
      "1/2 cup mayonnaise",
      "1/2 cup minced cilantro",
      "1 clove garlic, minced",
      "1/4 teaspoon ground chipotle pepper, to taste",
      "2 teaspoons lime zest, from one lime",
      "2 tablespoon lime juice, from one lime",
      "1/2 cup cotija cheese, crumbled",
      "Lime wedges, to serve"
    ],
    "instructions": "Heat a gas or charcoal grill to 400°F. Once the grill is hot, clean the grates.\nWhisk together the sauce: Meanwhile, whisk together the crema, mayonnaise, cilantro, garlic, chipotle pepper, lime zest, and lime juice. Taste and season the mixture with salt if needed. Set aside. Crema and cotija cheese have a little salt already, so add extra judiciously.\nGrill the corn: Place the husked corn directly onto grill grates. Grill the corn for about 3 minutes, undisturbed, or until kernels begin to turn golden brown and look charred. Turn over and repeat. When all sides are browned, remove from the grill onto a plate.\nTop the corn with sauce and cheese: Using a brush or a spoon, coat each ear of corn with the crema mixture. Sprinkle with crumbled cojita cheese. Sprinkle with additional chipotle pepper, if desired. Serve immediately with extra lime wedges. Did you like this recipe? Let us know with a rating and review!",
    "image": "https://www.simplyrecipes.com/thmb/T6vKgrAXYq2y_auc8B_1bhL6ifU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2016__07__2016-07-29-Street-Corn-12-b0a5fb59aeba49c98a3ae2656c6e8902.jpg",
    "yields": "8 servings",
    "nutrients": {
      "calories": "197 kcal",
      "carbohydrateContent": "19 g",
      "cholesterolContent": "20 mg",
      "fiberContent": "2 g",
      "proteinContent": "5 g",
      "saturatedFatContent": "4 g",
      "sodiumContent": "219 mg",
      "sugarContent": "4 g",
      "fatContent": "13 g",
      "servingSize": "6 to 8 servings",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/homemade_pizza/",
    "title": "Homemade Pizza & Pizza Dough",
    "ingredients": [
      "1 1/2 cups (355 ml) warm water (105°F-115°F)",
      "1 package (2 1/4 teaspoons) active dry yeast",
      "3 3/4 cups (490 g) bread flour",
      "2 tablespoons extra virgin olive oil (omit if cooking pizza in a wood-fired pizza oven)",
      "2 teaspoons salt",
      "1 teaspoon sugar",
      "Extra virgin olive oil",
      "Cornmeal (to help slide the pizza onto the pizza stone)",
      "Tomato sauce (smooth, or puréed)",
      "Firm mozzarella cheese, grated",
      "Fresh soft mozzarella cheese, separated into small clumps",
      "Fontina cheese, grated",
      "Parmesan cheese, grated",
      "Feta cheese, crumbled",
      "Mushrooms, very thinly sliced if raw, otherwise first sautéed",
      "Bell peppers, stems and seeds removed, very thinly sliced",
      "Italian pepperoncini, thinly sliced",
      "Italian sausage, cooked ahead and crumbled",
      "Sliced black olives",
      "Chopped fresh basil",
      "Baby arugula, tossed in a little olive oil, added as pizza comes out of the oven",
      "Pesto",
      "Pepperoni, thinly sliced",
      "Onions, thinly sliced raw or caramelized",
      "Ham, thinly sliced"
    ],
    "instructions": "Proof the yeast: Place the warm water in the large bowl of a heavy duty stand mixer. Sprinkle the yeast over the warm water and let it sit for 5 minutes until the yeast is dissolved. After 5 minutes stir if the yeast hasn't dissolved completely. The yeast should begin to foam or bloom, indicating that the yeast is still active and alive. (Note that if you are using \"instant yeast\" instead of \"active yeast\", no proofing is required. Just add to the flour in the next step.)\nMake and knead the pizza dough: Add the flour, salt, sugar, and olive oil, and using the mixing paddle attachment, mix on low speed for a minute. Then replace the mixing paddle with the dough hook attachment. Knead the pizza dough on low to medium speed using the dough hook about 7 to 10 minutes. If you don't have a mixer, you can mix the ingredients together and knead them by hand. The dough should be a little sticky or tacky to the touch. If it's too wet, sprinkle in a little more flour.\nLet the dough rise: Spread a thin layer of olive oil over the inside of a large bowl. Place the pizza dough in the bowl and turn it around so that it gets coated with the oil. At this point you can choose how long you want the dough to ferment and rise. A slow fermentation (24 hours in the fridge) will result in more complex flavors in the dough. A quick fermentation (1 1/2 hours in a warm place) will allow the dough to rise sufficiently to work with. Cover the dough with plastic wrap. For a quick rise, place the dough in a warm place (75°F to 85°F) for 1 1/2 hours. For a medium rise, place the dough in a regular room temperature place (your kitchen counter will do fine) for 8 hours. For a longer rise, chill the dough in the refrigerator for 24 hours (no more than 48 hours). The longer the rise (to a point) the better the flavor the crust will have.",
    "image": "https://www.simplyrecipes.com/thmb/KRw_r32s4gQeOX-d07NWY1OlOFk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Homemade-Pizza-Dough-Lead-Shot-1c-c2b1885d27d4481c9cfe6f6286a64342.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "322 kcal",
      "carbohydrateContent": "61 g",
      "cholesterolContent": "0 mg",
      "fiberContent": "2 g",
      "proteinContent": "10 g",
      "saturatedFatContent": "1 g",
      "sodiumContent": "710 mg",
      "sugarContent": "1 g",
      "fatContent": "4 g",
      "servingSize": "Makes 2 10-12-inch pizzas",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/nachos/",
    "title": "The Best Nachos",
    "ingredients": [
      "2 tablespoons chili powder",
      "1 1/2 teaspoons kosher salt",
      "1 teaspoon granulated garlic",
      "1 teaspoon granulated onion",
      "1 teaspoon ground cumin",
      "1/2 teaspoon dried oregano",
      "1/4 teaspoon black pepper",
      "Pinch of cayenne pepper (optional)",
      "1 teaspoon vegetable oil",
      "1 pound ground beef (80:20 lean-to-fat ratio)",
      "16 ounces (2 cups) refried beans, canned or homemade",
      "1/4 cup water",
      "1 large bag of tortilla chips",
      "4 ounces cheddar cheese, grated (about 2 cups), plus more for topping",
      "4 ounces Colby Jack cheese, grated (about 2 cups), plus more for topping",
      "1 cup pico de gallo, store-bought or homemade , plus more for topping",
      "1/4 cup chopped cilantro",
      "1 sliced jalapeño (pickled or fresh)",
      "Guacamole",
      "Salsa",
      "Sour cream",
      "Canned black olives",
      "Sliced green onions",
      "Shredded lettuce",
      "Corn",
      "Hot sauce"
    ],
    "instructions": "Preheat the oven to 350°F.\nMake the taco spice blend: Combine all of the spices (chili powder through cayenne) together in a small bowl.\nMake the beef and bean topping: Heat the vegetable oil on medium high heat until it begins to shimmer. Add the ground beef to the pan and season it with all of the taco spice blend. As the meat cooks, use a spoon to break the meat up into crumbles. Cook for about 8 minutes until the meat has browned and drain the fat using a colander. Return the meat to the pan and add the refried beans and the water. Heat the mixture until the beans are smooth and warmed through. Reduce the heat to low and keep the beef-bean mixture warm while you prepare the chips. Simply Recipes / Marta Rivera\nToast the chips: On a 13x18-inch oven-safe platter or sheet pan, arrange the tortilla chips in a single layer, overlapping them slightly. Toast the chips in the preheated oven for 5 minutes, or just until you begin to smell their aroma. Simply Recipes / Marta Rivera\nAssemble and bake the nachos: Carefully remove the pan from the oven and top with one half of the shredded cheeses. Allow the heat from the chips to melt the cheese slightly before topping the chips with the beef and bean mixture. Sprinkle the remaining cheese over the beef and return the pan to the oven for 5 minutes, or until the cheese has fully melted. Simply Recipes / Marta RiveraSimply Recipes / Marta RiveraSimply Recipes / Marta Rivera\nTop and serve: Top the nachos with the pico de gallo, chopped cilantro, jalapeño slices, or any of your preferred toppings. Serve hot. Did you love the recipe? Give us some stars and leave a comment below! Nachos taste best right after they’re made. Leftovers become soggy, stale, and just plain disappointing. Because they’re so easy to scale up or down, I recommend making only enough to eat in one sitting. It’s also not advisable to reheat any nachos that have been topped with sour cream.Simply Recipes / Marta Rivera",
    "image": "https://www.simplyrecipes.com/thmb/_38VUZIotH7LHCImZlAMMtlBl50=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__04__Nachos-LEAD-5-ab0842bd5c3a492b989240cca869cefb.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "1237 kcal",
      "carbohydrateContent": "40 g",
      "cholesterolContent": "305 mg",
      "fiberContent": "7 g",
      "proteinContent": "98 g",
      "saturatedFatContent": "29 g",
      "sodiumContent": "1432 mg",
      "sugarContent": "2 g",
      "fatContent": "75 g",
      "servingSize": "Serves 6",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/oven_baked_sweet_potato_fries/",
    "title": "Oven Baked Sweet Potato Fries",
    "ingredients": [
      "2 pounds orange fleshed sweet potatoes (yams), about 3 large ones",
      "3 tablespoons extra virgin olive oil",
      "1 1/2 teaspoons kosher salt",
      "1 to 2 tablespoons spice or spice combination of your choice: chipotle powder, smoked paprika, Chinese five-spice, pumpkin pie spice, garam masala, Cajun seasoning, etc."
    ],
    "instructions": "Preheat the oven to 450°F: For more crispiness, preheat your oven to 500°F. Place a roasting pan or heavy duty baking sheet (one that can take high heat) in the oven to preheat.\nPeel and cut the sweet potatoes into wedges: Peel the sweet potatoes and cut off the ends. Cut the potatoes in half lengthwise and then, if they are very long, in half crosswise. Cut each piece into 1/4 to 1/2-inch thick wedges. Alternately, you can slice the peeled sweet potato into disks either with a mandoline or a sharp knife. Simply Recipes / Eliezer MartinezSimply Recipes / Eliezer Martinez\nToss with the oil, salt, spices: Put the sweet potatoes into a large bowl and add the oil. Mix well to combine. Sprinkle with salt and spices of your choice. Use your hands to mix well, so all pieces are coated with oil and spices. Simply Recipes / Eliezer Martinez\nSpread onto preheated pan: Remove the preheated baking sheet from the oven. Carefully spread the sweet potatoes out in a single layer on the baking sheet. (Watch out, the pan is hot!) Simply Recipes / Eliezer Martinez\nBake: Bake for 15 to 25 minutes. After the first 10 minutes, remove the baking sheet from the oven and use tongs to turn over all of the sweet potato pieces. Return to the oven and bake for another 5 to 15 minutes, or until they are well browned. Cooking time depends on the temperature of the oven (500°F will need less cooking time than 450°F) and the size and thinness of the sweet potato wedges. The browner they are, the crispier they will be, but there is a fine line between browned and burnt beyond edibility. Even if they get really dark, they should still be good because of the natural sugars of the sweet potatoes caramelizing. So watch carefully. Simply Recipes / Eliezer MartinezSimply Recipes / Eliezer Martinez\nServe: When ready let the fries cool for 5 minutes before serving. Did you enjoy this recipe? Let us know with a rating and review! Simply Recipes / Eliezer Martinez",
    "image": "https://www.simplyrecipes.com/thmb/N6mx33bePy2rL9Nuw6lxzj0Alx4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Sweet-Potato-Fries-METHOD-LEAD-seo-v2-f3f5d040c93d43ecaf15b2a5f0a9844e.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "203 kcal",
      "carbohydrateContent": "33 g",
      "cholesterolContent": "0 mg",
      "fiberContent": "6 g",
      "proteinContent": "3 g",
      "saturatedFatContent": "1 g",
      "sodiumContent": "446 mg",
      "sugarContent": "10 g",
      "fatContent": "7 g",
      "servingSize": "Serves 4-6 as a side or snack",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/perfect_guacamole/",
    "title": "How to Make the Best Guacamole",
    "ingredients": [
      "2 ripe avocados",
      "1/4 teaspoon salt, plus more to taste",
      "1 tablespoon fresh lime or lemon juice",
      "2-4 tablespoons minced red onion or thinly sliced green onion",
      "1-2 serrano (or jalapeño) chiles, stems and seeds removed, minced",
      "2 tablespoons cilantro (leaves and tender stems), finely chopped",
      "Pinch freshly ground black pepper",
      "1/2 ripe tomato, chopped (optional)",
      "Red radish or jicama slices for garnish (optional)",
      "Tortilla chips , to serve"
    ],
    "instructions": "Cut the avocados: Cut the avocados in half. Remove the pit. Score the inside of the avocado with a blunt knife and scoop out the flesh with a spoon. (See How to Cut and Peel an Avocado.) Place in a bowl.\nMash the avocado flesh: Using a fork, roughly mash the avocado. Don't overdo it! The guacamole should be a little chunky.\nAdd the remaining ingredients to taste: Sprinkle with salt and lime (or lemon) juice. The acid in the lime juice will provide some balance to the richness of the avocado and will help delay the avocados from turning brown. Add the chopped onion, cilantro, black pepper, and chilis. Chili peppers vary individually in their spiciness. So, start with a half of one chili pepper and add more to the guacamole to your desired degree of heat. Remember that much of this is done to taste because of the variability in the fresh ingredients. Start with this recipe and adjust to your taste.\nServe immediately: If making a few hours ahead, place plastic wrap on the surface of the guacamole and press down to cover it to prevent air reaching it. (The oxygen in the air causes oxidation which will turn the guacamole brown.) Garnish with slices of red radish or jicama strips. Serve with your choice of store-bought tortilla chips or make your own homemade tortilla chips. Refrigerate leftover guacamole up to 3 days. Note: Chilling tomatoes dulls their flavor. So, if you want to add chopped tomato to your guacamole, add just before serving. Did you love the recipe? Let us know with a rating and review!",
    "image": "https://www.simplyrecipes.com/thmb/J4kA2m6jKMgkQwZhG-RYpjZBeFQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Guacamole-LEAD-6-2-64cfcca253c8421dad4e3fad830219f6.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "252 kcal",
      "carbohydrateContent": "16 g",
      "cholesterolContent": "0 mg",
      "fiberContent": "11 g",
      "proteinContent": "3 g",
      "saturatedFatContent": "3 g",
      "sodiumContent": "144 mg",
      "sugarContent": "2 g",
      "fatContent": "22 g",
      "servingSize": "Serves 2-4",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/perfect_lemonade/",
    "title": "Perfect Lemonade",
    "ingredients": [
      "1 cup white, granulated sugar (can reduce to 3/4 cup)",
      "1 cup water (for the simple syrup)",
      "1 cup lemon juice",
      "2 to 3 cups cold water (to dilute)"
    ],
    "instructions": "Make the simple syrup: Place the sugar and water in a small saucepan and bring to a simmer. Stir so that the sugar dissolves completely and remove from heat. Simply Recipes / Michelle Becker\nJuice the lemons: While the water is heating for the simple syrup, juice your lemons. Depending on the size of the lemons, 4 to 6 of them should be enough for 1 cup of juice. Simply Recipes / Michelle Becker\nMix the lemonade: Pour the juice and the simple syrup sugar water into a serving pitcher. Add 2 to 3 cups of cold water and taste. Add more water if you would like it to be more diluted (though note that when you add ice, it will melt and naturally dilute the lemonade). If the lemonade is a little sweet for your taste, add a little more straight lemon juice to it. Simply Recipes / Michelle Becker\nChill and serve: Refrigerate 30 to 40 minutes. Serve with ice and sliced lemons. Did you enjoy our recipe? Let us know with a rating and review! Simply Recipes / Michelle Becker",
    "image": "https://www.simplyrecipes.com/thmb/4LFrc9hSMoKErr2WI7tThcnvWwA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Perfect-Lemonade-LEAD-08-B-441ceb568f854bb485dbed79e082bb4a.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "104 kcal",
      "carbohydrateContent": "27 g",
      "cholesterolContent": "0 mg",
      "fiberContent": "0 g",
      "proteinContent": "0 g",
      "saturatedFatContent": "0 g",
      "sodiumContent": "16 mg",
      "sugarContent": "26 g",
      "fatContent": "0 g",
      "servingSize": "Serves 6",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/perfect_mashed_potatoes/",
    "title": "Perfect Mashed Potatoes",
    "ingredients": [
      "1 1/2 pounds (680 g) Yukon Gold potatoes, peeled and cut lengthwise into quarters",
      "1/2 teaspoon salt",
      "4 tablespoons (60 ml) heavy cream",
      "2 tablespoons (30 g) butter",
      "1 tablespoon milk (or more)",
      "Salt and pepper"
    ],
    "instructions": "Cook the potatoes: Place the peeled and cut potatoes into a medium saucepan. Add cold water to the pan until the potatoes are covered by at least 1 inch. Add 1/2 teaspoon of salt to the water. Turn the heat to high and bring the water to a boil. Reduce the heat to low to maintain a simmer, and cover. Cook for 15 to 20 minutes, or until you can easily poke through the potatoes with a fork. Simply Recipes / Annika PanikkerSimply Recipes / Annika PanikkerSimply Recipes / Annika Panikker\nHeat the butter and cream: While the potatoes are cooking, melt the butter and warm the cream together in a pan on the stove or in the microwave. Simply Recipes / Annika Panikker\nDrain and mash the potatoes: When the potatoes are done, drain the water and place the steaming hot potatoes into a large bowl. Pour the heated cream and melted butter over the potatoes, along with the remaining 1/2 teaspoon salt. Mash the potatoes with a potato masher. Then use a strong wooden spoon (a metal spoon might bend) to beat further. Add milk and beat until the mashed potatoes are smooth. Don't over-beat the potatoes or the mashed potatoes will end up gluey. Taste, then season as needed with salt and pepper. Did you love the recipe? Give us some stars and leave a comment below! Simply Recipes / Annika PanikkerSimply Recipes / Annika Panikker",
    "image": "https://www.simplyrecipes.com/thmb/FGJiOb23btBEtD2-f1U8nuc5fVI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Perfect-Mashed-Potatoes-LEAD-3-e4b02b5949c74b67873c3a7e9b8fb845.jpg",
    "yields": "4 servings",
    "nutrients": {
      "calories": "265 kcal",
      "carbohydrateContent": "37 g",
      "cholesterolContent": "34 mg",
      "fiberContent": "4 g",
      "proteinContent": "5 g",
      "saturatedFatContent": "7 g",
      "sodiumContent": "409 mg",
      "sugarContent": "3 g",
      "fatContent": "12 g",
      "servingSize": "Serves 4",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/perfect_popcorn/",
    "title": "Perfect Popcorn",
    "ingredients": [
      "3 tablespoons coconut oil or extra virgin olive oil",
      "1/3 cup of high quality popcorn kernels",
      "1 Tbsp or more (to taste) of butter (optional)",
      "Salt to taste"
    ],
    "instructions": "Heat the oil: Heat the oil in a 3-quart thick-bottomed saucepan on medium high heat. If you are using coconut oil, allow all of the solid oil to melt.\nPut 3 or 4 popcorn kernels into the oil: Wait for the popcorn kernels to pop.\nAdd the rest of the popcorn: When the kernels pop, add the rest of the 1/3 cup of popcorn kernels in an even layer\nCover the pot, remove from heat and count 30 seconds: (Count out loud! It's fun to do with kids.) This method first heats the oil to the right temperature, then waiting 30 seconds brings all of the other kernels to a near-popping temperature so that when they are put back on the heat, they all pop at about the same time.\nReturn the pan to the heat: The popcorn should begin popping soon, and all at once. Once the popping starts in earnest, gently shake the pan by moving it back and forth over the burner. As the popcorn pops, try to keep the lid slightly ajar to let the steam from the popcorn release (the popcorn will be drier and crisper and less tough).\nOnce the popping slows to several seconds between pops, remove the pan from the heat: Remove the lid and dump the popcorn immediately into a wide bowl. With this technique, nearly all of the kernels pop, and nothing burns.\nMelt butter in the empty hot pan: If you are adding butter, you can easily melt it by placing the butter in the now empty, but hot pan. If you let the butter get just a little bit brown, it will add an even more intense, buttery flavor to the butter and to your popcorn. Just drizzle the melted butter over the popcorn and toss to distribute.\nSprinkle the popcorn with salt to taste: Fun toppings for the popcorn: Spanish smoked paprika, nutritional yeast, cayenne powder, chili pepper, curry powder, cumin, grated Parmesan cheese. Did you enjoy this recipe? Let us know with a rating and review!",
    "image": "https://www.simplyrecipes.com/thmb/Xzggu-Md45HKhhYSw4DK8tGlZ_I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Perfect-Popcorn-LEAD-41-4a75a18443ae45aa96053f30a3ed0a6b.JPG",
    "yields": "4 servings",
    "nutrients": {
      "calories": "182 kcal",
      "carbohydrateContent": "19 g",
      "cholesterolContent": "0 mg",
      "fiberContent": "4 g",
      "proteinContent": "3 g",
      "saturatedFatContent": "9 g",
      "sodiumContent": "292 mg",
      "sugarContent": "0 g",
      "fatContent": "11 g",
      "servingSize": "Makes 2 quarts, enough for 2 people",
      "unsaturatedFatContent": "0 g"
    }
  },
  {
    "url": "https://www.simplyrecipes.com/recipes/spaghetti_alla_carbonara/",
    "title": "Pasta Carbonara",
    "ingredients": [
      "1 tablespoon extra virgin olive oil or unsalted butter",
      "1/2 pound pancetta or thick cut bacon, diced",
      "1-2 garlic cloves, minced, about 1 teaspoon (optional)",
      "3-4 whole eggs",
      "1 cup grated parmesan or pecorino cheese",
      "1 pound spaghetti (or bucatini or fettuccine)",
      "Salt and black pepper to taste"
    ],
    "instructions": "Heat the pasta water: Put a large pot of salted water on to boil (1 tablespoon salt for every 2 quarts of water.)\nSauté the pancetta or bacon and garlic: While the water is coming to a boil, heat the olive oil or butter in a large sauté pan over medium heat. Add the bacon or pancetta and cook slowly until crispy. Add the garlic (if using) and cook another minute, then turn off the heat and put the pancetta and garlic into a large bowl.\nBeat the eggs and half of the cheese: In a small bowl, beat the eggs and mix in about half of the cheese.\nCook the pasta: Once the water has reached a rolling boil, add the dry pasta, and cook, uncovered, at a rolling boil.\nToss the pasta with pancetta or bacon: When the pasta is al dente (still a little firm, not mushy), use tongs to move it to the bowl with the bacon and garlic. Let it be dripping wet. Reserve some of the pasta water. Move the pasta from the pot to the bowl quickly, as you want the pasta to be hot. It's the heat of the pasta that will heat the eggs sufficiently to create a creamy sauce. Toss everything to combine, allowing the pasta to cool just enough so that it doesn't make the eggs curdle when you mix them in. (That's the tricky part.)\nAdd the beaten egg mixture: Add the beaten eggs with cheese and toss quickly to combine once more. Add salt to taste. Add some pasta water back to the pasta to keep it from drying out. Serve at once with the rest of the parmesan and freshly ground black pepper. If you want, sprinkle with a little fresh chopped parsley.Did you enjoy this recipe? Let us know with a rating and review! Simply Recipes / Photo by Julia Gartland / Food Styling by Barrett Washburne",
    "image": "https://www.simplyrecipes.com/thmb/0UeN5LhKq-ze3BcZJ7_Yp803T24=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Pasta-Carbonara-LEAD-1-c477cc25c7294cd9a3fc51ece176481f.jpg",
    "yields": "6 servings",
    "nutrients": {
      "calories": "447 kcal",
      "carbohydrateContent": "25 g",
      "cholesterolContent": "166 mg",
      "fiberContent": "1 g",
      "proteinContent": "16 g",
      "saturatedFatContent": "11 g",
      "sodiumContent": "413 mg",
      "sugarContent": "1 g",
      "fatContent": "31 g",
      "servingSize": "Serves 4-6",
      "unsaturatedFatContent": "0 g"
    }
  }
]